{"appendicitis": "To diagnose appendicitis consider the following criteria: General symptoms usually include pain around the naval that shifts to the right lower quadrant (RLQ) of the abdomen, accompanied by fever and nausea or vomiting. During a physical examination, a patient might show RLQ tenderness, positive rebound tenderness, or signs of peritonitis. Laboratory tests may reveal signs of an inflammatory response, such as an elevated white blood cell count and elevated C-reactive protein levels. Imaging may disclose an enlarged appendix or possibly an appendicolith.", "cholecystitis": "To diagnose cholecystitis, consider the following criteria: General symptoms usually include pain in the right upper quadrant (RUQ) of the abdomen, fever, and nausea. During a physical examination, a patient might display RUQ tenderness or indications of jaundice. Laboratory tests may reveal signs of inflammation, such as elevated white blood cell count and C-reactive protein levels, liver damage, indicated through heightened Alanine Aminotransferase (ALT) or Asparate Aminotransferase (AST) levels, or gallbladder damage, indicated through heightened Bilirubin or Gamma Glutamyltransferase levels. Imaging may show gallstones, thickened gallbladder walls, pericholecystic fluid, and a distended gallbladder.", "diverticulitis": "To diagnose diverticulitis consider the following criteria: General symptoms typically encompass abdominal pain, primarily in the left lower quadrant (LLQ), along with fever, and nausea or vomiting. During a physical examination, a patient may display tenderness in the LLQ, fever, and signs of peritonitis. Laboratory tests often reveal signs of inflammation and infection, which may include an elevated white blood cell count and elevated C-reactive protein levels. Imaging findings often include bowel wall thickening, diverticula, inflammation, or abscesses around the affected segment of the colon.", "pancreatitis": "To diagnose pancreatitis consider the following criteria: General symptoms usually include abdominal pain, primarily in the epigastric region, along with nausea or vomiting. During a physical examination, a patient might display epigastric tenderness, fever, and signs of jaundice. Laboratory tests may reveal signs of inflammation, such as elevated white blood cell count and C-reactive protein levels, and pancreatic damage, indicated through heightened Amylase or Lipase levels. Further lab tests of hematocrit, urea nitrogen, triglycerides, calcium, sodium and potassium can indicate the severity of the disease. Imaging may show inflammation of the pancreas or fluid collection.", "gastroenteritis": "To diagnose gastroenteritis, consider the following criteria: General symptoms typically involve acute onset of diarrhea, which may be watery or bloody, often accompanied by nausea, vomiting, and sometimes fever. During a physical examination, the patient may present with abdominal tenderness, signs of dehydration such as dry mucous membranes and decreased skin turgor, and possibly hyperactive bowel sounds. Laboratory tests may show electrolyte imbalances like hypokalemia or hyponatremia and, in severe cases, an elevated hematocrit indicating dehydration. Imaging is generally not required for diagnosis but may show bowel wall thickening or edema in severe cases.", "gallstone disease": "To diagnose gallstone disease, consider the following criteria: General symptoms often include episodic right upper quadrant (RUQ) abdominal pain, especially postprandial, which may radiate to the back or right shoulder, accompanied by nausea and sometimes vomiting. During a physical examination, the patient might exhibit RUQ tenderness, and a positive Murphy’s sign can be indicative of acute cholecystitis. Laboratory tests can show elevated liver enzymes, particularly alkaline phosphatase, and in cases of cholangitis, there may be an elevation in white blood cell count and bilirubin levels. Imaging, particularly an ultrasound of the abdomen, is the primary diagnostic modality, revealing gallstones and possibly signs of inflammation of the gallbladder.", "colitis": "To diagnose colitis, consider the following criteria: General symptoms often include persistent diarrhea, which can be bloody, abdominal pain and cramping, and in some cases, symptoms of systemic illness such as fever and weight loss. During a physical examination, the patient may show abdominal tenderness, particularly in the lower quadrants, and may exhibit signs of dehydration or anemia depending on the severity and duration of symptoms. Laboratory tests typically reveal signs of inflammation, such as an elevated white blood cell count, elevated C-reactive protein, and possibly anemia; stool tests may be done to rule out infectious causes. Imaging, particularly a CT scan of the abdomen, can show bowel wall thickening and inflammation, and colonoscopy may be used for definitive diagnosis, revealing mucosal inflammation, ulceration, and in chronic cases, changes in the bowel architecture.", "suspected perf": "To diagnose suspected perforation (perforated viscus), consider the following criteria: General symptoms typically include sudden, severe abdominal pain, often described as sharp or tearing, which may be localized or diffuse, and can be accompanied by signs of systemic illness such as fever and a rapid heart rate. During a physical examination, the patient may exhibit marked abdominal tenderness, rigidity (board-like abdomen), and absence of bowel sounds, indicative of peritonitis. Laboratory tests often reveal leukocytosis with a left shift, elevated C-reactive protein, and metabolic derangements such as acidosis in severe cases. Imaging, particularly an upright or decubitus abdominal X-ray, may show free air under the diaphragm (pneumoperitoneum), and a CT scan of the abdomen is more sensitive for detecting free air and localizing the site of perforation.", "pancreatic cancer": "To diagnose pancreatic cancer, consider the following criteria: General symptoms typically include pain in the upper abdomen that may radiate to the back, unexplained weight loss, jaundice, and new-onset diabetes or changes in bowel habits. During a physical examination, findings may include jaundice, palpable gallbladder (Courvoisier's sign), and in some cases, ascites or hepatomegaly. Laboratory tests often reveal elevated levels of liver enzymes, particularly in obstructive jaundice, and elevated tumor markers such as CA 19-9 and CEA can be suggestive but are not definitive. Imaging, starting with abdominal ultrasound and followed by more definitive studies like CT or MRI, typically shows a mass in the pancreas, with CT providing detailed information regarding the extent of the disease and involvement of surrounding structures.", "cholelithiasis": "To diagnose cholelithiasis, consider the following criteria: General symptoms typically include intermittent right upper quadrant (RUQ) abdominal pain, often described as biliary colic, which can radiate to the back or right shoulder and is commonly triggered by fatty meals. During a physical examination, the patient may exhibit RUQ tenderness, but often the physical exam is unremarkable unless complications like cholecystitis are present. Laboratory tests may be normal in uncomplicated cholelithiasis, but in cases of choledocholithiasis or cholecystitis, there might be elevated liver enzymes and bilirubin levels. Ultrasound imaging of the abdomen is the most effective diagnostic tool, revealing the presence of gallstones within the gallbladder.", "acute alcoholic hepatitis": "To diagnose acute alcoholic hepatitis, consider the following criteria: General symptoms typically include jaundice, abdominal pain and swelling, nausea, and vomiting, often in a patient with a history of significant alcohol intake. During a physical examination, the patient may exhibit hepatomegaly (enlarged liver), tenderness in the right upper quadrant, and signs of chronic liver disease such as spider angiomas and palmar erythema. Laboratory tests often reveal elevated liver enzymes (particularly AST more than ALT, usually in a 2:1 ratio), elevated bilirubin levels, and often a prolonged prothrombin time indicating impaired liver function. Imaging, such as ultrasound or CT of the abdomen, may show liver enlargement and altered echotexture but is primarily used to exclude other causes of liver disease.", "acuta cholangitis": "To diagnose acute cholangitis, consider the following criteria: General symptoms typically include the Charcot's triad of right upper quadrant (RUQ) abdominal pain, fever, and jaundice, with some patients also experiencing rigors or changes in mental status. During a physical examination, the patient may exhibit RUQ tenderness, and jaundice may be evident on skin and scleral examination. Laboratory tests often show elevated liver enzymes (particularly alkaline phosphatase), bilirubin, and white blood cell count, indicating biliary obstruction and infection. Imaging, usually an abdominal ultrasound or MRCP (Magnetic Resonance Cholangiopancreatography), is critical and typically reveals dilated bile ducts and may identify the cause of obstruction, such as gallstones.", "septicemia": "To diagnose septicemia, consider the following criteria: General symptoms typically include high fever or hypothermia, chills, rapid breathing and heart rate, and in severe cases, altered mental status or signs of shock such as hypotension. During a physical examination, the patient may present with signs of systemic infection, including hypotension, tachycardia, tachypnea, and in some cases, specific signs related to the source of infection. Laboratory tests are crucial and may reveal elevated white blood cell count, elevated lactate levels indicating tissue hypoperfusion, and positive blood cultures, which are essential for confirming the diagnosis. Imaging studies are often used to identify the source of infection, such as chest X-ray for pneumonia, abdominal imaging for intra-abdominal infections, or CT scans for complicated infections in various body sites.", "gallbladder cancer": "To diagnose gallbladder cancer, consider the following criteria: General symptoms often include vague upper abdominal pain, jaundice, and unintended weight loss, sometimes accompanied by nausea and loss of appetite. During a physical examination, the patient may exhibit right upper quadrant (RUQ) tenderness, a palpable abdominal mass in the RUQ, and jaundice or other signs of liver dysfunction. Laboratory tests may show abnormal liver function tests, particularly elevated bilirubin levels, and in some cases, elevated CA 19-9 and carcinoembryonic antigen (CEA) levels. Imaging is crucial for diagnosis and staging, with abdominal ultrasound often revealing a mass in the gallbladder, and further evaluation with CT or MRI can assess the extent of the disease and possible metastasis.", "small bowel obstruction": "To diagnose a small bowel obstruction, consider the following criteria: General symptoms typically include crampy abdominal pain, nausea, vomiting (which may include bilious emesis), and cessation of passing gas or stool. During a physical examination, the patient might present with abdominal distension, hyperactive bowel sounds initially (which may become hypoactive or silent if the obstruction persists), and tenderness upon palpation. Laboratory tests often reveal electrolyte imbalances due to vomiting and dehydration, and in severe cases, an elevated white blood cell count may indicate ischemia or perforation. Imaging is crucial, with an abdominal X-ray showing dilated bowel loops and air-fluid levels, and a CT scan of the abdomen providing more detailed information, including the location and cause of the obstruction.", "appendix abscess": "To diagnose an appendix abscess, consider the following criteria: General symptoms often include persistent abdominal pain, typically localized to the right lower quadrant (RLQ), which may be more diffuse if the abscess is large, accompanied by fever, chills, and malaise. During a physical examination, the patient may exhibit localized RLQ tenderness, possibly with a palpable mass in the RLQ, and signs of systemic infection such as tachycardia. Laboratory tests typically reveal a marked leukocytosis with a left shift, indicating a significant inflammatory and infectious response. Imaging, especially a CT scan of the abdomen, is crucial for diagnosis, revealing a well-circumscribed fluid collection in the area of the appendix with possible surrounding inflammation.", "sigmoid diverticulosis": "To diagnose sigmoid diverticulosis, consider the following criteria: General symptoms often include intermittent, mild lower abdominal pain, typically in the left lower quadrant (LLQ), bloating, and alterations in bowel habits, although many patients may be asymptomatic. During a physical examination, the patient may exhibit tenderness in the LLQ of the abdomen, without signs of peritoneal irritation, and occasionally palpable thickened bowel loops in chronic cases. Laboratory tests are usually normal but may show mild elevations in white blood cell count if inflammation is present; however, these are not specific to diverticulosis. Imaging, particularly a CT scan of the abdomen, is the most sensitive modality, potentially showing the presence of multiple diverticula in the sigmoid colon, with no evidence of inflammation or complications like diverticulitis.", "colon polyps": "To diagnose colon polyps, consider the following criteria: General symptoms can be non-specific and often polyps are asymptomatic, but they may include rectal bleeding, change in bowel habits, and occasionally abdominal pain. During a physical examination, there may be little to find, but a digital rectal examination can sometimes detect rectal polyps. Laboratory tests often do not directly indicate polyps but can detect signs of complications, such as anemia due to chronic blood loss in cases of large or multiple polyps. Colonoscopy is the primary imaging and diagnostic tool, allowing for direct visualization and biopsy of polyps, and can be complemented by CT colonography in certain cases for further assessment.", "metastatic ovarian cancer": "To diagnose metastatic ovarian cancer, consider the following criteria: General symptoms often include abdominal bloating, pelvic or abdominal pain, early satiety, and urinary urgency or frequency, which may be nonspecific and can mimic benign conditions. During a physical examination, there may be findings such as a palpable abdominal or pelvic mass, ascites, and in advanced stages, potential signs of metastasis like supraclavicular lymphadenopathy (Virchow's node). Laboratory tests can show elevated cancer markers such as CA-125, and in some cases, abnormal liver function tests or anemia may be present. Imaging, especially a transvaginal ultrasound, can reveal ovarian masses with complex features, and CT scans of the abdomen and pelvis are crucial for detecting metastases to the liver, lymph nodes, or other abdominal organs.", "acute liver failure": "To diagnose metastatic acute liver failure, consider the following criteria: General symptoms may include rapid onset of jaundice, fatigue, and confusion, which can progress to encephalopathy, alongside symptoms related to the primary cancer. During a physical examination, the patient might exhibit hepatomegaly, ascites, and signs of chronic liver disease such as spider angiomas or palmar erythema, depending on the extent of liver involvement. Laboratory tests typically reveal markedly elevated liver enzymes, coagulopathy (elevated INR), and possibly abnormal tumor markers depending on the type of primary cancer. Imaging, especially with CT or MRI, can identify liver masses suggestive of metastases, along with assessing the primary cancer site and other metastatic sites.", "cirrhotic liver disease": "To diagnose metastatic cirrhotic liver disease, consider the following criteria: General symptoms often include fatigue, weight loss, and symptoms related to liver dysfunction such as jaundice and ascites. During a physical examination, findings may include hepatomegaly, signs of chronic liver disease like spider angiomas, palmar erythema, and in advanced cases, features of portal hypertension such as splenomegaly and caput medusae. Laboratory tests typically show liver function abnormalities including elevated liver enzymes, bilirubin, and in many cases, a decreased albumin and prolonged prothrombin time. Imaging, especially contrast-enhanced CT or MRI of the abdomen, can reveal irregular liver morphology, nodularity indicative of cirrhosis, and lesions suggestive of metastasis, along with potential vascular invasion or lymph node involvement.", "lower gastrointestinal bleeding": "To diagnose lower gastrointestinal bleeding, consider the following criteria: General symptoms typically include the passage of fresh or altered blood rectally, which can range from bright red to dark maroon or even black, often accompanied by changes in bowel habits and sometimes abdominal pain. During a physical examination, the patient might exhibit signs of anemia such as pallor, tachycardia, or hypotension, depending on the severity of the bleed, and rectal examination can provide information on the character and source of the bleeding. Laboratory tests should include a complete blood count showing potential anemia, blood typing and crossmatching if transfusion is anticipated, and coagulation profiles to identify coagulopathies. Imaging and endoscopic studies, such as a colonoscopy, are essential for localization and characterization of the bleeding source, and may show diverticula, angiodysplasia, neoplasms, or other sources of bleeding.", "pancreatic pseudocyst": "To diagnose a pancreatic pseudocyst, consider the following criteria: General symptoms may include persistent abdominal pain, often in the upper abdomen, which may radiate to the back, along with symptoms of pancreatic insufficiency such as weight loss, steatorrhea, or diabetes. During a physical examination, the patient might exhibit epigastric tenderness or a palpable mass in the upper abdomen, and in severe cases, signs of jaundice. Laboratory tests can reveal elevated serum amylase and lipase levels, especially if there is concurrent acute pancreatitis, and liver function tests may be abnormal if the cyst is compressing the bile duct. Imaging, particularly abdominal CT scan or MRI, is critical for diagnosis, showing a well-encapsulated fluid collection typically in proximity to the pancreas.", "acute colonic perf": "To diagnose acute colonic perforation, consider the following criteria: General symptoms typically include sudden and severe abdominal pain, which may be generalized or localized, often accompanied by signs of systemic illness such as fever, nausea, or vomiting. During a physical examination, the patient may exhibit signs of acute abdomen such as severe tenderness, rigidity, and guarding, suggesting peritonitis. Laboratory tests often reveal leukocytosis with a left shift, indicating an acute inflammatory response, and metabolic derangements may occur in severe cases. Imaging, particularly an upright or decubitus abdominal X-ray, may reveal free air under the diaphragm, indicating perforation, while CT scans can provide more detailed information about the site and cause of the perforation.", "left upper quadrant mass lesion": "To diagnose a left upper quadrant (LUQ) mass lesion, consider the following criteria: General symptoms may vary widely depending on the underlying pathology but can include localized or diffuse abdominal pain, fullness or discomfort in the LUQ, and symptoms related to compression of adjacent structures like early satiety or dyspepsia. During a physical examination, a palpable mass may be detectable in the LUQ, and there may be signs of systemic illness such as weight loss or cachexia, depending on the etiology. Laboratory tests might reveal abnormalities that are indirect markers of the underlying cause, such as anemia, abnormal liver function tests, or elevated markers of malignancy (e.g., CA-125, CEA, depending on the suspected pathology). Imaging, particularly abdominal ultrasound or CT scan, is crucial and can provide detailed information about the size, nature, and potential origin of the mass, whether it be splenic, renal, gastric, pancreatic, or related to other adjacent structures or tissues.", "gallstone obstruction": "To diagnose gallstone obstruction consider the following criteria: General symptoms frequently encompass persistent right upper quadrant (RUQ) abdominal pain, radiating to the back or right shoulder, accompanied by episodes of nausea or vomiting, especially after fatty meals. Physical examination may reveal RUQ tenderness, positive Murphy’s sign, or signs of jaundice. Laboratory tests often indicate abnormal liver function tests like elevated alkaline phosphatase, elevated bilirubin levels, and sometimes a mild elevation in white blood cell count. Imaging with ultrasonography typically shows gallstones, biliary ductal dilatation, and may also demonstrate a thickened gallbladder wall if cholecystitis is present.", "acute gastroenteritis": "To diagnose acute gastroenteritis, consider the following criteria: General symptoms commonly involve acute onset of diarrhea, which may be watery or bloody, accompanied by vomiting and abdominal cramps. During physical examination, patients may exhibit signs of dehydration such as dry mucous membranes, reduced skin turgor, and hypotension. Laboratory tests often indicate signs of electrolyte imbalances like hypokalemia or hyponatremia and may show elevated blood urea nitrogen (BUN) in cases of significant dehydration. Imaging is typically not required for diagnosis but may be used to rule out other conditions if the presentation is atypical.", "ruptured ovarian cyst": "To diagnose a ruptured ovarian cyst, consider the following criteria: General symptoms often consist of sudden-onset, sharp or dull pelvic pain, which may be accompanied by bloating, and sometimes referred shoulder pain due to diaphragmatic irritation. Physical examination may reveal unilateral pelvic tenderness, adnexal tenderness upon bimanual examination, and signs consistent with peritoneal irritation or hemodynamic instability in cases of significant hemorrhage. Laboratory test results could indicate a mild to moderate increase in white blood cell count and evidence of hCG negative if pregnancy is excluded; in cases with substantial bleeding, a decrease in hematocrit and hemoglobin levels may be present. Imaging with transvaginal ultrasound may show evidence of free fluid in the pelvis, particularly in the cul-de-sac, and the absence of an identifiable cyst in the ovary, suggesting its rupture.", "pyelonephritis": "To diagnose pyelonephritis, consider the following criteria: General symptoms often involve flank pain, high fever, chills, and gastrointestinal symptoms like nausea or vomiting. During a physical examination, a patient may exhibit costovertebral angle tenderness, which is indicative of inflammation of the kidney. Laboratory tests typically reveal a urinary tract infection with the presence of white blood cells and bacteria in the urine, as well as a positive urine culture; blood tests may show elevated white blood cell count and elevated inflammatory markers such as C-reactive protein. Imaging, particularly a renal ultrasound or CT scan, can demonstrate abnormalities in the kidney's structure, such as swelling or obstruction, suggesting an upper urinary tract infection.", "obstructive jaundice": "To diagnose obstructive jaundice, consider the following criteria: General symptoms often consist of yellow discoloration of the skin and sclerae (icterus), dark urine, pale stools, and pruritus. During physical examination, there may be hepatomegaly, right upper quadrant pain, and possible detection of a gallbladder mass (Courvoisier's sign) if the obstruction is due to malignancy. Laboratory tests typically show elevated serum bilirubin, particularly direct bilirubin, along with abnormal liver function tests including elevated alkaline phosphatase (ALP) and gamma-glutamyl transferase (GGT) levels. Imaging findings suggestive of obstructive jaundice include dilated intrahepatic and/or extrahepatic biliary ducts on ultrasound, CT or MRCP, and identification of potential causes such as gallstones, strictures, or tumors.", "gastric malt recurrence": "To diagnose gastric MALT lymphoma recurrence, consider the following criteria: General symptoms may consist of epigastric discomfort or pain, recurrent ulcer-like dyspepsia, weight loss, and early satiety. Physical examination might reveal epigastric tenderness upon palpation, and in some cases, lymphadenopathy could be present. Laboratory tests often show persistent or returning elevation in serum lactate dehydrogenase (LDH) and beta2-microglobulin levels which may suggest recurrence; however, standard blood tests can often be non-specific. Imaging and endoscopic ultrasound may demonstrate thickening of the gastric wall, while PET scans can help in identifying areas of increased metabolic activity suggestive of recurrence, although biopsy via endoscopy remains the definitive method.", "cholangiocarcinoma": "To diagnose cholangiocarcinoma consider the following criteria: General symptoms often encompass jaundice, pruritus, abdominal pain, weight loss, and sometimes fever. Physical examination may reveal hepatomegaly, a palpable gallbladder (Courvoisier's sign), and possibly ascites in advanced cases. Laboratory tests tend to indicate cholestasis with elevated alkaline phosphatase, gamma-glutamyl transferase, and bilirubin levels; CA 19-9 may also be elevated, albeit not specific. Imaging typically shows biliary ductal dilation with or without a mass lesion, and can include ultrasound, CT, MRI, or MRCP to delineate the extent of the tumor and vascular involvement.", "right renal angiomyolipoma": "To diagnose right renal angiomyolipoma consider the following criteria: General symptoms can be subtle or non-existent but may include flank pain, palpable mass in the flank or abdomen, and occasionally hematuria if complications occur. Upon physical examination, a patient might have a detectable mass in the right flank or tenderness in the costovertebral angle on the affected side. Laboratory test results are typically normal but may reveal signs of anemia or abnormal renal function tests if there is bleeding or renal impairment. Imaging studies, especially an ultrasound or computed tomography (CT) scan without contrast, may show a fat-containing tumor in the right kidney, which is highly suggestive of an angiomyolipoma.", "gallbladder polyp": "To diagnose gallbladder polyps consider the following criteria: General symptoms might include episodic or persistent right upper quadrant abdominal pain, which may be associated with meals, but many patients can be asymptomatic. During a physical examination, there may be mild to moderate tenderness in the right upper quadrant, yet often no specific physical are evident. Laboratory tests might show normal values; elevated liver enzymes or bilirubin levels could suggest a polyp obstructing the bile duct. Ultrasound imaging typically reveals a hyperechoic lesion projecting from the gallbladder wall without shadowing, and polyps can be differentiated from gallstones in most cases.", "acute kidney stone": "To diagnose acute kidney stone, consider the following criteria: General symptoms often consist of severe, colicky pain in the flank and side, which may radiate to the lower abdomen and groin, often associated with hematuria, urinary urgency, nausea, or vomiting. During a physical examination, the patient may exhibit renal angle tenderness and demonstrate pain during percussion, along with signs of discomfort or restlessness. Laboratory tests typically reveal hematuria, crystalluria, and possibly signs of infection such as leukocytosis if an accompanying infection is present; urine analysis may demonstrate high levels of stone-forming substances like calcium, oxalate, or uric acid. Imaging findings, especially on non-contrast CT scans of the abdomen and pelvis, may demonstrate the presence of calculi in the kidneys or urinary tract, occasionally accompanied by signs of urinary obstruction such as hydronephrosis.", "crohn's disease": "To diagnose Crohn's disease, consider the following criteria: General symptoms typically involve persistent diarrhea, abdominal pain, which may be worse after meals, along with weight loss and fatigue. Physical examination may reveal abdominal tenderness, particularly in the lower right quadrant, a palpable abdominal mass, and perianal disease. Laboratory tests often show evidence of inflammation, such as an elevated C-reactive protein (CRP) and erythrocyte sedimentation rate (ESR), along with possible anemia and nutrient deficiencies. Imaging, including colonoscopy and CT or MRI enterography, may demonstrateal bowel wall thickening, strictures, and fistulas consistent with Crohn's disease.", "pancreatic cystic lesion": "To diagnose a pancreatic cystic lesion, consider the following criteria: General symptoms may encompass abdominal pain radiating to the back, early satiety, and unintentional weight loss. Upon physical examination, a palpable mass in the upper abdomen may be found, along with signs of jaundice if the common bile duct is obstructed. Laboratory tests could reveal elevated liver enzymes or bilirubin levels and potentially changes in pancreatic enzymes such as amylase or lipase. Imaging, preferably with contrast-enhanced computed tomography (CT) scan or magnetic resonance imaging (MRI), may show the presence of cystic formations within the pancreas with details on size, location, and characteristics like septations or nodules that could suggest malignancy.", "bile leak": "To diagnose a bile leak, consider the following criteria: General symptoms often include persistent abdominal pain, particularly in the upper right quadrant, along with fever, jaundice, or changes in bowel movements. Physical examination may reveal jaundice, right upper quadrant tenderness, and signs of peritonitis if bile has leaked into the peritoneal cavity. Laboratory tests typically show elevated liver enzymes, especially alkaline phosphatase and gamma-glutamyl transpeptidase, and possibly signs of infection such as leukocytosis. Imaging, including hepatobiliary iminodiacetic acid (HIDA) scan, can detect extraluminal tracer indicative of bile extravasation, and abdominal ultrasound or CT may demonstrate bile collection or biloma.", "inflammatory bowel disease": "To diagnose Inflammatory Bowel Disease (IBD), consider the following criteria: General symptoms often include chronic diarrhea, abdominal pain, weight loss, and fatigue. Physical examination may reveal abdominal tenderness, especially in the lower quadrants, possibly with signs of perianal disease in Crohn's or bloody diarrhea in ulcerative colitis. Laboratory tests typically show evidence of inflammation with elevated white blood cell count, C-reactive protein, and erythrocyte sedimentation rate; anemia and nutrient deficiencies may also be present. Imaging and endoscopy can demonstrate mucosal inflammation, with colonoscopy revealing ulcerations, strictures, or fistulae in Crohn's, and continuous colonic involvement in ulcerative colitis, complemented by biopsy findings characteristic of IBD.", "Infrarenal abdominal aortic aneurysm with multiple peripheral aneurysms": "To diagnose an infrarenal abdominal aortic aneurysm with multiple peripheral aneurysms, consider the following criteria: General symptoms may include a pulsating feeling near the navel, unexplained severe pain in the abdomen or lower back, or symptoms related to peripheral aneurysms depending on their location. During a physical examination, a pulsatile abdominal mass may be palpable, especially in thin patients. Laboratory tests are not typically diagnostic but may be used to assess overall health and readiness for potential surgery. Imaging, particularly abdominal ultrasound or CT angiography, may reveal a dilated infrarenal aorta and the presence of peripheral aneurysms.", "* Diabetic ketoacidosis (DKA)": "To diagnose Diabetic Ketoacidosis (DKA), consider the following criteria: General symptoms often include excessive thirst, frequent urination, nausea, abdominal pain, weakness, and confusion. During a physical examination, a patient might show signs of dehydration such as dry mouth, sunken eyes, and rapid heart rate. Laboratory tests may reveal high blood sugar levels (hyperglycemia), ketones in urine, and metabolic acidosis with a high anion gap. Imaging is not typically used in the diagnosis of DKA, but may be employed to rule out other conditions if the patient presents with abdominal pain.", "Hepatocellular carcinoma (HCC) with portal vein thrombosis (PVT)": "To diagnose Hepatocellular carcinoma (HCC) with portal vein thrombosis (PVT) consider the following criteria: General symptoms often include abdominal pain, weight loss, and jaundice. During a physical examination, a patient might present with hepatomegaly, ascites, or signs of liver failure. Laboratory tests may reveal elevated alpha-fetoprotein (AFP) levels, abnormal liver function tests, and thrombocytopenia. Imaging, such as ultrasound, CT, or MRI, may show a liver mass and evidence of portal vein thrombosis.", "Celiac artery stenosis": "To diagnose Celiac artery stenosis consider the following criteria: General symptoms often include abdominal pain, particularly after eating, unexplained weight loss, and diarrhea. During a physical examination, a patient might show signs of malnutrition or abdominal bruit in the epigastric region. Laboratory tests may reveal signs of malabsorption, such as low levels of vitamins and minerals, and anemia. Imaging, particularly Doppler ultrasound or computed tomography angiography (CTA), may show narrowing or blockage of the celiac artery.", "Septic shock": "To diagnose septic shock, consider the following criteria: General symptoms often include altered mental status, rapid heart rate, and severe discomfort, often accompanied by fever, chills, and extreme weakness. During a physical examination, the patient may exhibit low blood pressure not responsive to fluid replacement, decreased urine output, and mottled or discolored skin. Laboratory tests may reveal increased lactate levels, abnormal coagulation parameters, and evidence of organ dysfunction such as elevated liver enzymes or decreased platelet count. Imaging may show signs of the source of infection, such as pneumonia on a chest X-ray or abscess on an ultrasound or CT scan.", "Liver Metastases": "To diagnose liver metastases consider the following criteria: General symptoms may include unexplained weight loss, loss of appetite, nausea, and abdominal discomfort or pain. During a physical examination, a patient might present with hepatomegaly (enlarged liver), jaundice, or ascites. Laboratory tests may reveal elevated liver enzymes, such as alanine transaminase (ALT) and aspartate transaminase (AST), and abnormal levels of bilirubin and alkaline phosphatase. Imaging, such as an ultrasound, CT, or MRI, may show multiple irregular lesions in the liver, often with a characteristic \"bull's-eye\" or \"target\" appearance.", "**Jaundice** - yellowish skin": "To diagnose Jaundice consider the following criteria: General symptoms usually include yellowing of the skin, eyes, and mucous membranes, often accompanied by fatigue, abdominal pain, weight loss, or itching. During a physical examination, a patient might show signs of liver enlargement or tenderness, and the presence of spider angiomas. Laboratory tests may reveal elevated bilirubin levels, abnormal liver function tests, and possibly anemia. Imaging such as ultrasound, CT, or MRI may show liver abnormalities, gallstones, or blockages in the bile ducts.", "Duodenitis": "To diagnose Duodenitis consider the following criteria: General symptoms often include upper abdominal pain, nausea, vomiting, and sometimes weight loss. During a physical examination, the patient may exhibit tenderness in the upper abdomen or signs of dehydration if vomiting is severe. Laboratory tests may show anemia or elevated white blood cell count if the inflammation is severe or if there's an infection. Endoscopic imaging of the duodenum may reveal erythema, erosions, or ulcerations in the duodenal wall.", "Inappropriate sinus tachycardia": "To diagnose Inappropriate Sinus Tachycardia (IST), consider the following criteria: General symptoms often include palpitations, fatigue, lightheadedness, and shortness of breath, which are exacerbated by physical activity or stress. During a physical examination, a patient might present with a resting heart rate above 100 beats per minute or a heart rate that increases rapidly with minimal exertion. Laboratory tests may not reveal specific abnormalities, but a thorough evaluation should be done to rule out other causes of tachycardia such as hyperthyroidism or anemia. Imaging, specifically an echocardiogram, may be normal but is important to exclude structural heart diseases.", "Based on the provided information": "To diagnose Based on the provided information, consider the following criteria: General symptoms typically include [specific general symptoms]. During a physical examination, a patient might exhibit [specific physical examination findings]. Laboratory tests may reveal [specific laboratory test results]. Imaging may show [specific imaging findings].", "Acute Cholecysitis": "To diagnose acute cholecystitis consider the following criteria: General symptoms usually include severe right upper quadrant (RUQ) abdominal pain that may radiate to the right shoulder or back, accompanied by fever, nausea, and vomiting. During a physical examination, a patient might show RUQ tenderness, guarding, and possibly a positive Murphy's sign. Laboratory tests may reveal an elevated white blood cell count, increased levels of liver enzymes (such as alanine aminotransferase and aspartate aminotransferase), and elevated bilirubin levels. Imaging, such as ultrasound or CT scan, may show gallbladder wall thickening, pericholecystic fluid, gallstones, or signs of inflammation.", "Pulmonary Embolism": "To diagnose Pulmonary Embolism consider the following criteria: General symptoms often include sudden onset of shortness of breath, chest pain (sharp or pleuritic in nature), and sometimes coughing up blood. During a physical examination, a patient might exhibit signs of tachypnea, tachycardia, and possibly low oxygen saturation levels. Laboratory tests may reveal an elevated D-dimer level, indicating the presence of blood clotting. Imaging, such as a computed tomography pulmonary angiography (CTPA), may show a filling defect within the pulmonary arteries suggestive of a clot.", "Hodgkin's lymphoma": "To diagnose Hodgkin's lymphoma, consider the following criteria: General symptoms often include painless swelling of lymph nodes, particularly in the neck, armpits, or groin, along with unexplained weight loss, persistent fatigue, and night sweats. Physical examination may reveal enlarged lymph nodes, hepatosplenomegaly, or signs of systemic involvement. Laboratory tests may show an elevated erythrocyte sedimentation rate (ESR), elevated levels of serum lactate dehydrogenase (LDH), and presence of Reed-Sternberg cells on lymph node biopsy. Imaging studies, such as CT or PET scans, may demonstrate enlarged lymph nodes with characteristic patterns of involvement, as well as potential involvement of other organs.", "Epiploic Appendagitis": "To diagnose Epiploic Appendagitis consider the following criteria: General symptoms usually include sudden onset localized abdominal pain, often in the left lower quadrant, which may be aggravated by movement or deep breathing. During a physical examination, a patient might show localized tenderness and a palpable tender mass in the affected area. Laboratory tests are typically unremarkable, with no specific abnormalities. Imaging, such as computed tomography (CT) scan, may reveal characteristic findings of inflamed epiploic appendages, including oval-shaped fat density lesions with a peripheral hyperattenuating rim.", "Arteriovenous malformation (AVM) with subsequent hemorrhage": "To diagnose Arteriovenous malformation (AVM) with subsequent hemorrhage, consider the following criteria: General symptoms may include sudden and severe headache, seizures, focal neurological deficits, altered consciousness, or signs of increased intracranial pressure. During a physical examination, a patient might exhibit neurological abnormalities, such as weakness, sensory deficits, or abnormal reflexes. Laboratory tests may show signs of anemia or abnormal coagulation parameters. Imaging, such as cerebral angiography or magnetic resonance imaging (MRI), may reveal an abnormal tangle of blood vessels with arteriovenous shunting and evidence of hemorrhage, such as intracerebral or subarachnoid hemorrhage.", "Ampullary tumor (most likely diagnosis)": "To diagnose an ampullary tumor as the most likely diagnosis, consider the following criteria: General symptoms may include jaundice, abdominal pain, weight loss, and digestive disturbances. During a physical examination, a patient might exhibit jaundice, palpable abdominal mass, or signs of biliary obstruction. Laboratory tests may reveal elevated liver enzymes, bilirubin levels, and tumor markers such as CA 19-9. Imaging studies, such as abdominal ultrasound or MRI, may show a mass in the ampullary region or dilatation of the bile ducts.", "Recurrent UTI (polymicrobial) with failed suppressive therapy": "To diagnose recurrent polymicrobial urinary tract infection (UTI) with failed suppressive therapy, consider the following criteria: General symptoms typically include frequent episodes of urinary tract infection with symptoms such as dysuria, urgency, frequency, and suprapubic pain. During a physical examination, a patient may not exhibit any specific findings, but tenderness over the suprapubic area may be present. Laboratory tests may reveal persistent or recurrent bacteriuria with multiple organisms, positive urine cultures, and leukocytosis. Imaging studies, such as ultrasound or computed tomography (CT) scan, may be performed to assess for any underlying structural abnormalities or complications contributing to the recurrent UTI.", "* Monoclonal gammapathy": "To diagnose monoclonal gammopathy, consider the following criteria: General symptoms may include fatigue, weakness, recurrent infections, bone pain, or unexplained weight loss. Physical examination findings may include enlarged lymph nodes, hepatosplenomegaly, or signs of organ damage. Laboratory tests may reveal the presence of a monoclonal protein spike on serum protein electrophoresis or immunofixation, along with abnormal levels of immunoglobulins. Imaging studies, such as skeletal surveys or whole-body positron emission tomography (PET) scans, may show lytic bone lesions or other evidence of organ involvement.", "Severe Hypotension": "To diagnose severe hypotension, consider the following criteria: General symptoms typically include a significant drop in blood pressure, resulting in dizziness, lightheadedness, confusion, or loss of consciousness. During a physical examination, a patient may exhibit weak or thready pulses, cool and clammy skin, and decreased urine output. Laboratory tests may reveal low blood pressure readings, decreased hemoglobin levels, and electrolyte imbalances. Imaging studies are not typically used for diagnosing hypotension, but may be performed to identify underlying causes such as internal bleeding or organ dysfunction.", "* Acute respiratory failure": "To diagnose acute respiratory failure, consider the following criteria: General symptoms typically involve sudden onset of difficulty breathing, rapid breathing, or shortness of breath, often accompanied by cyanosis or bluish discoloration of the lips and fingertips. During a physical examination, the patient may exhibit increased work of breathing, use of accessory muscles, or decreased breath sounds. Laboratory tests may reveal low oxygen levels (hypoxemia) and high carbon dioxide levels (hypercapnia) in arterial blood gas analysis. Imaging studies, such as chest X-ray or CT scan, may show underlying lung pathology, such as consolidation, infiltrates, or pleural effusion.", "Postoperative ileus": "To diagnose postoperative ileus, consider the following criteria: General symptoms typically include abdominal distension, absence of bowel movements, and discomfort or pain in the abdomen. During a physical examination, a patient may exhibit decreased or absent bowel sounds and abdominal tenderness. Laboratory tests may show electrolyte imbalances, such as low potassium levels, and elevated white blood cell count due to inflammation. Imaging studies, such as abdominal X-rays or CT scans, may reveal dilated loops of bowel and the absence of gas in the intestines.", "Necrotizing fasciitis of the lower extremity": "To diagnose necrotizing fasciitis of the lower extremity, consider the following criteria: General symptoms typically include severe pain and tenderness in the affected area, accompanied by swelling, erythema, and warmth. During a physical examination, a patient might exhibit crepitus, bullae formation, or necrotic skin. Laboratory tests may reveal elevated white blood cell count, elevated C-reactive protein levels, and metabolic acidosis. Imaging, such as computed tomography (CT) or magnetic resonance imaging (MRI), may show soft tissue gas, fascial thickening, or fluid collections.", "Acute kidney injury": "To diagnose Acute kidney injury (AKI), consider the following criteria: General symptoms may include decreased urine output, fluid retention, fatigue, confusion, and shortness of breath. During a physical examination, a patient might exhibit signs of fluid overload, such as edema or elevated blood pressure. Laboratory tests may reveal elevated levels of serum creatinine and blood urea nitrogen (BUN), as well as abnormalities in electrolyte levels. Imaging studies, such as renal ultrasound or CT scan, may show structural abnormalities or obstruction in the kidneys.", "* Severe aplastic anemia": "To diagnose severe aplastic anemia, consider the following criteria: General symptoms typically include fatigue, weakness, and pallor due to severe anemia, along with increased susceptibility to infections and bleeding tendencies. Physical examination may reveal signs of anemia, such as tachycardia and systolic murmurs, as well as petechiae, ecchymoses, or other signs of bleeding. Laboratory tests often show pancytopenia, with low red blood cell, white blood cell, and platelet counts, and a bone marrow biopsy demonstrates hypocellular marrow with decreased or absent hematopoietic cells. Imaging studies are not typically required for the diagnosis of severe aplastic anemia.", "High-grade B-cell lymphoma": "To diagnose High-grade B-cell lymphoma consider the following criteria: General symptoms may include unexplained weight loss, night sweats, and fatigue. Physical examination findings may reveal enlarged lymph nodes, hepatosplenomegaly, or signs of extranodal involvement. Laboratory tests may show an elevated lactate dehydrogenase (LDH) level and anemia. Imaging studies may demonstrate enlarged lymph nodes, organ infiltration, or masses in various locations.", "Benign Papillary Stenosis": "To diagnose Benign Papillary Stenosis consider the following criteria: General symptoms may include recurrent episodes of abdominal pain, particularly in the upper right quadrant, accompanied by nausea and vomiting. During a physical examination, a patient might exhibit tenderness in the upper right abdomen or signs of jaundice. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST). Imaging studies, such as ultrasound or magnetic resonance cholangiopancreatography (MRCP), may show dilated bile ducts or evidence of biliary obstruction.", "NASH cirrhosis": "To diagnose NASH cirrhosis, consider the following criteria: General symptoms may include fatigue, weight loss, and abdominal discomfort. Physical examination findings may reveal hepatomegaly, splenomegaly, or signs of portal hypertension such as ascites or spider angiomas. Laboratory tests may show elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as abnormal liver function tests and markers of liver fibrosis, such as elevated levels of hyaluronic acid or enhanced liver fibrosis (ELF) score. Imaging studies, such as ultrasound or MRI, may demonstrate liver steatosis, fibrosis, or cirrhosis.", "Gallbladder Distension": "To diagnose gallbladder distension, consider the following criteria: General symptoms typically include right upper quadrant (RUQ) abdominal pain, bloating, and discomfort after meals. During a physical examination, a patient might exhibit RUQ tenderness upon palpation or a palpable mass in the RUQ. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST). Imaging, such as ultrasound or CT scan, may show an enlarged gallbladder with distended walls and the presence of gallstones.", "Gallstones with mild intrahepatic biliary duct dilation": "To diagnose gallstones with mild intrahepatic biliary duct dilation, consider the following criteria: General symptoms may include right upper quadrant abdominal pain, especially after meals, accompanied by bloating, indigestion, and occasional nausea or vomiting. During a physical examination, a patient might exhibit tenderness in the right upper quadrant of the abdomen or jaundice. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as elevated bilirubin levels. Imaging studies, such as ultrasound or computed tomography (CT), may show the presence of gallstones within the gallbladder and mild dilation of the intrahepatic biliary ducts.", "* Aspiration pneumonia": "To diagnose aspiration pneumonia, consider the following criteria: General symptoms typically involve coughing or choking during or after eating or drinking, accompanied by fever, shortness of breath, and chest pain. Physical examination findings may include crackling sounds in the lungs (rales), decreased breath sounds, and signs of respiratory distress. Laboratory tests may reveal an elevated white blood cell count and abnormal levels of inflammatory markers such as C-reactive protein. Imaging, such as a chest X-ray, may show infiltrates or consolidation in the affected lung segment or lobe, and in severe cases, evidence of lung abscess or cavitation.", "A": "To diagnose A, consider the following criteria: General symptoms typically involve fatigue, weight loss, and persistent fever. Physical examinations may reveal enlarged lymph nodes, abnormal skin lesions, or organomegaly. Laboratory test results may show abnormal blood cell counts, elevated inflammatory markers, or specific antibodies. Imaging results may indicate the presence of abnormal masses or lesions in specific organs or tissues.", "Multiple myeloma with compression fracture of L2 vertebra": "To diagnose Multiple myeloma with compression fracture of L2 vertebra, consider the following criteria: General symptoms typically include bone pain, fatigue, weakness, and recurrent infections. Physical examination findings may include tenderness over the affected vertebra, decreased range of motion, and signs of spinal cord compression. Laboratory tests may reveal anemia, elevated serum calcium levels, elevated creatinine levels, and monoclonal gammopathy. Imaging, such as X-rays or MRI, may show compression fracture of the L2 vertebra, lytic bone lesions, or osteoporosis.", "Atrial fibrillation": "To diagnose Atrial fibrillation consider the following criteria: General symptoms may include palpitations, irregular heartbeat, fatigue, shortness of breath, dizziness, and chest discomfort. During a physical examination, a patient might have an irregularly irregular pulse, rapid heart rate, and signs of heart failure. Laboratory tests may reveal an elevated thyroid-stimulating hormone (TSH) level, abnormal electrolyte levels, and markers of cardiac damage. Imaging, such as an electrocardiogram (ECG), may show characteristic irregular and chaotic atrial activity with absence of P waves.", "End-stage osteoarthritis": "To diagnose end-stage osteoarthritis, consider the following criteria: General symptoms typically include chronic joint pain, stiffness, and limited range of motion, often worsening with activity and improving with rest. Physical examination may reveal joint deformities, crepitus, and loss of joint function. Laboratory tests are not specific for osteoarthritis but may be used to rule out other conditions, such as inflammatory arthritis. Imaging, such as X-rays or MRI, may show joint space narrowing, subchondral sclerosis, osteophyte formation, and joint effusion.", "Moderate-severe dementia": "To diagnose moderate-severe dementia, consider the following criteria: General symptoms typically include progressive cognitive decline, impaired memory, language difficulties, and difficulties with problem-solving and complex tasks. During a physical examination, patients may exhibit signs of neurological deficits, such as abnormal reflexes or muscle weakness. Laboratory tests may reveal normal results, as dementia is primarily diagnosed based on clinical presentation. Imaging, such as magnetic resonance imaging (MRI), may show atrophy in specific brain regions, such as the hippocampus or frontal lobes.", "Intertrochanteric fracture of the left femur": "To diagnose an intertrochanteric fracture of the left femur, consider the following criteria: General symptoms typically include severe pain in the left hip or thigh, difficulty bearing weight on the affected leg, and limited range of motion. During a physical examination, a patient may exhibit tenderness over the left hip area, swelling, and deformity. Laboratory tests may not be specific for this fracture, but can help rule out other conditions and assess overall health. Imaging, such as X-rays or CT scans, may reveal a fracture line extending between the greater and lesser trochanters of the left femur, indicating an intertrochanteric fracture.", "Hepatic Steatosis": "To diagnose Hepatic Steatosis consider the following criteria: General symptoms may be absent or nonspecific, but can include fatigue, malaise, and mild right upper quadrant discomfort. During a physical examination, hepatomegaly may be present, and there may be signs of metabolic syndrome or risk factors for fatty liver disease. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as an increased gamma-glutamyl transferase (GGT) level. Imaging, such as ultrasound or computed tomography (CT), may show increased liver echogenicity or hepatic steatosis.", "Pancreatic necrosis": "To diagnose pancreatic necrosis consider the following criteria: General symptoms typically include severe abdominal pain that radiates to the back, accompanied by nausea, vomiting, and fever. During a physical examination, a patient might exhibit abdominal tenderness, guarding, and possibly signs of systemic inflammation. Laboratory tests may reveal elevated levels of pancreatic enzymes, such as amylase and lipase, as well as markers of systemic inflammation, such as elevated white blood cell count and C-reactive protein levels. Imaging, such as computed tomography (CT) scan, may show evidence of pancreatic necrosis, including areas of non-enhancement or fluid collections within the pancreas.", "Status post expiratory laparotomy": "To diagnose Status post expiratory laparotomy, consider the following criteria: General symptoms may include abdominal pain, wound healing, and postoperative recovery. During a physical examination, the patient may exhibit surgical incisions, signs of wound infection, or abdominal tenderness. Laboratory tests may reveal elevated white blood cell count, signs of infection, or abnormal wound healing markers. Imaging may show surgical clips, staples, or sutures in the abdominal region, as well as any postoperative complications such as abscess formation or fluid collections.", "* Multinodular goiter": "To diagnose multinodular goiter consider the following criteria: General symptoms may include a visible or palpable enlargement of the thyroid gland, which may or may not be associated with symptoms of hyperthyroidism or hypothyroidism. During a physical examination, a patient might exhibit a diffusely enlarged thyroid gland with multiple nodules of varying sizes. Laboratory tests may reveal normal thyroid hormone levels or may show signs of hyperthyroidism or hypothyroidism depending on the underlying cause. Imaging, such as ultrasound, may show multiple nodules within the thyroid gland, with or without increased vascularity.", "Ruptured Appendix": "To diagnose a ruptured appendix, consider the following criteria: General symptoms typically include severe and worsening abdominal pain, often starting around the naval and spreading to the entire abdomen, accompanied by fever, chills, and a sense of illness. During a physical examination, a patient may exhibit severe tenderness and guarding throughout the abdomen, along with signs of peritonitis, such as rebound tenderness and rigidity. Laboratory tests may reveal an elevated white blood cell count, increased levels of inflammatory markers like C-reactive protein, and signs of infection, such as an elevated body temperature. Imaging studies, such as a computed tomography (CT) scan, may show evidence of an enlarged appendix with surrounding fluid collection, abscess formation, or free air in the abdominal cavity.", "Vascular Dementia": "To diagnose Vascular Dementia, consider the following criteria: General symptoms typically involve a decline in cognitive abilities, including memory loss, difficulty with problem-solving and decision-making, and impaired attention and concentration. Physical examinations may reveal signs of neurological deficits, such as weakness or paralysis in one or more limbs, gait disturbances, or abnormal reflexes. Laboratory tests may not provide specific markers for Vascular Dementia, but they can help rule out other potential causes of cognitive decline, such as thyroid dysfunction or vitamin deficiencies. Imaging, particularly brain imaging such as MRI or CT scans, may show evidence of cerebrovascular disease, such as multiple infarcts or white matter changes, which are characteristic of Vascular Dementia.", "Hyperthyroidism with possible lymphoproliferative disorder": "To diagnose hyperthyroidism with possible lymphoproliferative disorder, consider the following criteria: General symptoms typically include weight loss, increased appetite, heat intolerance, palpitations, and fatigue. During a physical examination, a patient may exhibit an enlarged thyroid gland (goiter), tremors, and signs of hyperactivity. Laboratory tests may reveal elevated levels of thyroid hormones (T3 and T4) and suppressed levels of thyroid-stimulating hormone (TSH). Additionally, there may be abnormal lymphocyte counts or other markers suggestive of a lymphoproliferative disorder. Imaging studies, such as ultrasound or CT scan, may show an enlarged thyroid gland and potential lymph node involvement.", "Perforated Sigmoid Diverticulum": "To diagnose Perforated Sigmoid Diverticulum consider the following criteria: General symptoms typically include sudden onset of severe abdominal pain, often localized to the left lower quadrant (LLQ), accompanied by fever, chills, and signs of systemic infection. During a physical examination, a patient may exhibit LLQ tenderness, guarding, and rebound tenderness, along with signs of peritonitis. Laboratory tests may reveal an elevated white blood cell count, increased inflammatory markers, and evidence of sepsis. Imaging studies, such as a CT scan, may demonstrate the presence of free air or fluid in the abdomen, thickening of the sigmoid colon wall, and the presence of diverticula with surrounding inflammation.", "Thrombosed inferior mesenteric vein with surrounding stranding": "To diagnose thrombosed inferior mesenteric vein with surrounding stranding, consider the following criteria: General symptoms may include abdominal pain, often localized to the left lower quadrant, accompanied by diarrhea or bloody stools. During a physical examination, tenderness may be present in the left lower quadrant, and signs of peritonitis may be observed in severe cases. Laboratory tests may reveal elevated D-dimer levels, indicating the presence of a thrombus, and possibly an elevated white blood cell count if there is associated inflammation. Imaging, such as computed tomography (CT) or magnetic resonance imaging (MRI), may show a thrombus within the inferior mesenteric vein, along with surrounding stranding or edema in the adjacent mesentery.", "Gallbladder inflammation": "To diagnose gallbladder inflammation, consider the following criteria: General symptoms typically include severe pain in the upper right abdomen, often radiating to the back or right shoulder, accompanied by nausea, vomiting, and bloating. During a physical examination, a patient may exhibit tenderness in the right upper quadrant (RUQ) of the abdomen, and possibly a positive Murphy's sign. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as an increased white blood cell count. Imaging studies, such as an ultrasound or CT scan, may show gallbladder wall thickening, gallstones, or signs of inflammation, such as pericholecystic fluid.", "Gangrenous Gallbladder": "To diagnose gangrenous gallbladder consider the following criteria: General symptoms typically include severe abdominal pain, often in the right upper quadrant (RUQ), accompanied by fever, chills, and jaundice. During a physical examination, a patient may exhibit RUQ tenderness, guarding, and rebound tenderness. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as elevated bilirubin levels. Imaging, such as ultrasound or CT scan, may show a distended gallbladder with thickened walls, pericholecystic fluid, and absence of gallstones.", "Perforated gallbladder": "To diagnose perforated gallbladder, consider the following criteria: General symptoms typically include severe abdominal pain, often radiating to the right shoulder, accompanied by fever, chills, and jaundice. During a physical examination, a patient may exhibit abdominal tenderness, guarding, and rigidity, along with signs of peritonitis. Laboratory tests may reveal elevated liver enzymes, bilirubin levels, and leukocytosis. Imaging studies, such as ultrasound or CT scan, may show signs of gallbladder wall thickening, pericholecystic fluid collection, or free intraperitoneal air.", "Acute Gastrointestinal Ble": "To diagnose Acute Gastrointestinal Bleeding, consider the following criteria: General symptoms often include sudden onset of bright red or dark, tarry stools, along with symptoms of anemia such as fatigue and weakness. During a physical examination, a patient may present with signs of hypovolemia, such as low blood pressure and rapid heart rate, as well as abdominal tenderness or distension. Laboratory tests may reveal a decrease in hemoglobin and hematocrit levels, indicating blood loss, and an elevated blood urea nitrogen (BUN) level. Imaging studies, such as upper gastrointestinal endoscopy or colonoscopy, may identify the source of bleeding, such as ulcers, varices, or tumors.", "Constipation": "To diagnose constipation consider the following criteria: General symptoms typically include infrequent bowel movements, difficulty passing stools, and a feeling of incomplete evacuation. During a physical examination, a patient may exhibit abdominal distension, palpable fecal masses, or signs of fecal impaction. Laboratory tests are usually not necessary for the diagnosis of constipation. Imaging, such as abdominal X-rays, may reveal evidence of fecal impaction or stool retention in the colon.", "Acute Coronary Syndrome": "To diagnose Acute Coronary Syndrome (ACS), consider the following criteria: General symptoms typically include chest pain or discomfort that may radiate to the left arm, jaw, or back, often accompanied by shortness of breath, diaphoresis, and a sense of impending doom. During a physical examination, the patient may exhibit signs of distress, such as pallor, cool and clammy skin, and an irregular heart rate or rhythm. Laboratory tests may reveal elevated cardiac biomarkers, such as troponin, indicating myocardial damage, as well as abnormalities in other cardiac enzymes. Imaging, such as an electrocardiogram (ECG), may show ST-segment elevation or depression, T-wave inversion, or the presence of pathological Q waves, suggesting myocardial ischemia or infarction.", "Severe Spinal Stenosis": "To diagnose severe spinal stenosis, consider the following criteria: General symptoms typically involve progressive and worsening pain in the back, buttocks, and legs, often accompanied by numbness, tingling, or weakness in the lower extremities. Physical examination findings may include reduced range of motion, muscle weakness, and diminished reflexes in the affected areas. Laboratory tests are generally not specific for spinal stenosis, but may be useful in ruling out other potential causes of symptoms. Imaging studies, such as MRI or CT scans, are essential for confirming the diagnosis and may reveal significant narrowing of the spinal canal, compression of nerve roots, and degenerative changes in the spine.", "Acute Gallstone Attack": "To diagnose Acute Gallstone Attack, consider the following criteria: General symptoms typically include sudden and severe pain in the upper right abdomen, often radiating to the back or right shoulder, accompanied by nausea and vomiting. During a physical examination, a patient may exhibit tenderness in the right upper quadrant (RUQ) of the abdomen, and possibly a positive Murphy's sign. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as an increased white blood cell count. Imaging, such as an abdominal ultrasound, may show the presence of gallstones in the gallbladder or evidence of inflammation, such as gallbladder wall thickening or pericholecystic fluid.", "Acute Severe Abdomen Pain": "To diagnose acute severe abdomen pain, consider the following criteria: General symptoms typically involve sudden and intense abdominal pain that may be localized or diffuse, often accompanied by nausea, vomiting, and/or sweating. During a physical examination, the patient may exhibit guarding, rigidity, or rebound tenderness in the abdomen. Laboratory tests may reveal elevated white blood cell count, signs of inflammation, or abnormal liver or pancreatic enzymes. Imaging studies, such as abdominal ultrasound or CT scan, may show evidence of organ inflammation, obstruction, or perforation.", "Gallstone Impaction": "To diagnose gallstone impaction, consider the following criteria: General symptoms typically include severe and sudden right upper quadrant (RUQ) abdominal pain, often radiating to the back or right shoulder, accompanied by nausea and vomiting. During a physical examination, a patient may exhibit RUQ tenderness and possibly a positive Murphy's sign. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as elevated bilirubin levels. Imaging, such as ultrasound or CT scan, may demonstrate the presence of gallstones in the gallbladder or common bile duct, along with signs of biliary obstruction, such as dilated bile ducts or gallbladder wall thickening.", "Appendicular Perforation": "To diagnose appendicular perforation, consider the following criteria: General symptoms typically include severe and worsening abdominal pain, often localized to the right lower quadrant (RLQ), accompanied by fever, chills, and signs of systemic infection. During a physical examination, a patient may exhibit severe RLQ tenderness, guarding, rigidity, and rebound tenderness, along with signs of peritonitis, such as abdominal distension and decreased bowel sounds. Laboratory tests may reveal an elevated white blood cell count, increased inflammatory markers (e.g., C-reactive protein), and signs of sepsis. Imaging studies, such as abdominal CT scan or ultrasound, may demonstrate evidence of appendiceal perforation, including abscess formation, free fluid, or air within the abdominal cavity.", "Terminal ileitis": "To diagnose terminal ileitis, consider the following criteria: General symptoms typically include chronic abdominal pain, diarrhea, and weight loss. During a physical examination, tenderness and palpable masses may be observed in the right lower quadrant of the abdomen. Laboratory tests may reveal anemia, elevated inflammatory markers (such as C-reactive protein and erythrocyte sedimentation rate), and nutritional deficiencies. Imaging studies, such as computed tomography (CT) or magnetic resonance enterography (MRE), may show thickening of the terminal ileum, narrowing or strictures, and sometimes the presence of skip lesions.", "Sepsis secondary to urinary tract infection": "To diagnose sepsis secondary to urinary tract infection, consider the following criteria: General symptoms typically include fever, chills, and malaise, along with signs of systemic inflammation such as tachycardia and tachypnea. During a physical examination, a patient may exhibit hypotension, altered mental status, and signs of organ dysfunction. Laboratory tests may reveal leukocytosis or leukopenia, elevated lactate levels, and abnormal liver or kidney function tests. Imaging studies may not be specific for sepsis but can be used to identify the source of infection, such as pyelonephritis or urinary tract obstruction.", "Insulin dependent diabetes mellitus with possible ischemic colitis": "To diagnose insulin-dependent diabetes mellitus (IDDM) with possible ischemic colitis, consider the following criteria: General symptoms typically include polyuria, polydipsia, unexplained weight loss, and fatigue, along with abdominal pain and bloody diarrhea. During a physical examination, a patient might exhibit signs of dehydration, such as dry mucous membranes and decreased skin turgor, as well as tenderness in the lower abdomen. Laboratory tests may reveal hyperglycemia, glycosuria, ketonuria, and an elevated HbA1c level, indicating poor glycemic control. Imaging studies, such as a computed tomography (CT) scan or colonoscopy, may show evidence of ischemic colitis, such as thickening of the colonic wall or ulcerations.", "Diverticular Perforation": "To diagnose diverticular perforation, consider the following criteria: General symptoms typically include sudden and severe abdominal pain, often localized to the left lower quadrant (LLQ), accompanied by fever, chills, and anorexia. During a physical examination, a patient may exhibit LLQ tenderness, guarding, and signs of peritonitis. Laboratory tests may reveal an elevated white blood cell count, increased inflammatory markers such as C-reactive protein, and possibly evidence of infection. Imaging studies, such as computed tomography (CT) scan, may demonstrate the presence of diverticula, signs of inflammation, and the presence of free air or fluid in the abdominal cavity.", "Acute Gallbladder Attack": "To diagnose an acute gallbladder attack, consider the following criteria: General symptoms typically include severe pain in the upper right abdomen, often radiating to the back or right shoulder, accompanied by nausea and vomiting. During a physical examination, a patient may exhibit tenderness in the right upper quadrant (RUQ) of the abdomen, and possibly a positive Murphy's sign. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as an increased white blood cell count. Imaging studies, such as an ultrasound or CT scan, may show gallstones, gallbladder wall thickening, or signs of inflammation in the gallbladder.", "Diverticular Abscess": "To diagnose Diverticular Abscess consider the following criteria: General symptoms typically include persistent abdominal pain, usually localized in the left lower quadrant (LLQ), accompanied by fever and changes in bowel habits. During a physical examination, a patient might exhibit LLQ tenderness, guarding, or signs of peritonitis. Laboratory tests may reveal an elevated white blood cell count and increased inflammatory markers, such as C-reactive protein. Imaging, such as computed tomography (CT) scan, may demonstrate the presence of a localized abscess adjacent to a colonic diverticulum.", "Acute Myelofibrosis": "To diagnose Acute Myelofibrosis, consider the following criteria: General symptoms often include fatigue, weakness, and unexplained weight loss, along with symptoms related to anemia, such as shortness of breath and pale skin. Physical examination findings may reveal an enlarged spleen, hepatomegaly, or lymphadenopathy. Laboratory tests may show pancytopenia, including low red blood cell, white blood cell, and platelet counts, as well as abnormal peripheral blood smear findings, such as teardrop-shaped red blood cells and nucleated red blood cells. Imaging studies, such as a bone marrow biopsy or MRI, may demonstrate fibrosis in the bone marrow, along with the presence of abnormal megakaryocytes and increased reticulin fibers.", "Pancreatic Head Stone": "To diagnose pancreatic head stone, consider the following criteria: General symptoms typically include persistent and severe abdominal pain, often radiating to the back, accompanied by weight loss and jaundice. During a physical examination, a patient might exhibit tenderness in the upper abdomen and possibly a palpable mass. Laboratory tests may reveal elevated liver enzymes, bilirubin levels, and pancreatic enzymes, such as amylase and lipase. Imaging studies, such as abdominal ultrasound or CT scan, may show the presence of a calcified stone within the pancreatic head, causing obstruction of the pancreatic duct.", "Pelvic Abscess": "To diagnose pelvic abscess, consider the following criteria: General symptoms typically include pelvic pain, fever, and a feeling of general illness. During a physical examination, a patient may exhibit tenderness in the lower abdomen or pelvis, along with signs of inflammation such as redness or warmth. Laboratory tests may reveal an elevated white blood cell count and increased levels of inflammatory markers, such as C-reactive protein. Imaging studies, such as ultrasound or computed tomography (CT) scan, may show a fluid collection or abscess in the pelvic region.", "Gallbladder Wall Edema": "To diagnose gallbladder wall edema, consider the following criteria: General symptoms typically include right upper quadrant abdominal pain, often radiating to the back or right shoulder, accompanied by nausea and vomiting. During a physical examination, a patient may exhibit tenderness in the right upper quadrant of the abdomen, and in severe cases, jaundice may be present. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as elevated bilirubin levels. Imaging studies, such as ultrasound or computed tomography (CT), may show thickening of the gallbladder wall and pericholecystic fluid.", "Systemic Lupus Erythematosus (SLE) with cutaneous involvement": "To diagnose Systemic Lupus Erythematosus (SLE) with cutaneous involvement, consider the following criteria: General symptoms often include fatigue, joint pain, and fever, along with characteristic skin manifestations such as a malar rash (butterfly rash) across the cheeks and bridge of the nose, discoid rash (raised, scaly patches), or photosensitivity. During a physical examination, a patient may exhibit joint tenderness or swelling, and there may be evidence of other organ involvement. Laboratory tests may reveal positive antinuclear antibodies (ANA) and other autoantibodies, such as anti-double-stranded DNA (anti-dsDNA) or anti-Smith (anti-Sm) antibodies. Imaging studies are typically not necessary for the diagnosis of SLE, but they may be used to assess organ involvement if indicated.", "Nephrolithiasis": "To diagnose nephrolithiasis consider the following criteria: General symptoms typically include severe flank pain that radiates to the groin, accompanied by hematuria and urinary urgency or frequency. During a physical examination, a patient might exhibit costovertebral angle tenderness or signs of renal colic. Laboratory tests may reveal elevated levels of blood urea nitrogen (BUN) and creatinine, as well as the presence of red blood cells in the urine. Imaging studies, such as a non-contrast CT scan, may demonstrate the presence of kidney stones and their location within the urinary tract.", "Rectovaginal Fistula": "To diagnose rectovaginal fistula consider the following criteria: General symptoms typically include the passage of feces or gas through the vagina, along with persistent vaginal discharge and foul odor. During a physical examination, a patient may exhibit signs of infection, such as redness, swelling, or tenderness around the vaginal area, as well as the presence of fecal matter in the vagina. Laboratory tests may reveal an elevated white blood cell count and signs of infection. Imaging, such as a contrast-enhanced computed tomography (CT) scan or magnetic resonance imaging (MRI), may demonstrate the fistula tract between the rectum and vagina, confirming the diagnosis.", "Steroid withdrawal syndrome": "To diagnose steroid withdrawal syndrome, consider the following criteria: General symptoms typically include fatigue, weakness, and malaise, along with musculoskeletal pain and joint stiffness. Physical examination findings may reveal signs of adrenal insufficiency, such as hypotension, dehydration, and hyperpigmentation. Laboratory tests may show low cortisol levels, elevated adrenocorticotropic hormone (ACTH) levels, and electrolyte imbalances, such as hyponatremia and hyperkalemia. Imaging studies are usually not necessary for the diagnosis of steroid withdrawal syndrome.", "Spondylodiscitis": "To diagnose spondylodiscitis, consider the following criteria: General symptoms typically include localized back pain that worsens with movement, accompanied by fever and fatigue. During a physical examination, a patient might exhibit tenderness over the affected spinal region, limited range of motion, and signs of neurological deficits. Laboratory tests may reveal an elevated erythrocyte sedimentation rate (ESR) and C-reactive protein (CRP) levels, indicating an inflammatory response. Imaging, such as magnetic resonance imaging (MRI), may show vertebral endplate destruction, disc space narrowing, and adjacent soft tissue inflammation or abscess formation.", "Appendiceal Inflammation": "To diagnose appendiceal inflammation, consider the following criteria: General symptoms typically include abdominal pain, often starting around the naval and migrating to the right lower quadrant (RLQ), accompanied by fever and possible nausea or vomiting. During a physical examination, the patient may exhibit RLQ tenderness, localized guarding, or rebound tenderness. Laboratory tests may reveal an elevated white blood cell count and increased levels of C-reactive protein, indicating an inflammatory response. Imaging studies, such as ultrasound or computed tomography (CT), may show an enlarged appendix with thickened walls and peri-appendiceal inflammation.", "Acute Gallbladder Torsion": "To diagnose Acute Gallbladder Torsion, consider the following criteria: General symptoms typically include sudden onset severe right upper quadrant (RUQ) abdominal pain, often radiating to the back or right shoulder, accompanied by nausea and vomiting. During a physical examination, a patient may exhibit RUQ tenderness, guarding, and rebound tenderness. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as elevated bilirubin levels. Imaging studies, such as ultrasound or computed tomography (CT), may demonstrate a twisted gallbladder with a characteristic \"whirl sign\" or \"corkscrew appearance.\"", "Metastatic Melanoma": "To diagnose metastatic melanoma, consider the following criteria: General symptoms often include the presence of a pigmented skin lesion that has changed in size, shape, or color, accompanied by symptoms such as fatigue, weight loss, or unexplained pain. During a physical examination, a patient may exhibit enlarged lymph nodes, skin nodules, or organ-specific symptoms depending on the site of metastasis. Laboratory tests may reveal elevated levels of lactate dehydrogenase (LDH) and liver function abnormalities. Imaging studies, such as CT scans or PET scans, may show evidence of distant metastasis in organs such as the lungs, liver, brain, or bones.", "Obesity-related steatohepatitis with possible underlying uterine fibroids": "To diagnose obesity-related steatohepatitis with possible underlying uterine fibroids, consider the following criteria: General symptoms often include fatigue, abdominal discomfort, and unintentional weight gain, along with irregular menstrual cycles or heavy menstrual bleeding. During a physical examination, a patient might exhibit an enlarged abdomen, hepatomegaly, or signs of liver dysfunction. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as markers of inflammation and insulin resistance. Imaging studies, such as ultrasound or MRI, may show evidence of hepatic steatosis and fibrosis, as well as the presence of uterine fibroids.", "Complete Heart Block": "To diagnose Complete Heart Block, consider the following criteria: General symptoms typically include dizziness, syncope (fainting), fatigue, and shortness of breath. During a physical examination, a patient may exhibit bradycardia (slow heart rate), irregular heart rhythm, and signs of decreased cardiac output. Laboratory tests may reveal elevated levels of cardiac enzymes, such as troponin, indicating myocardial damage. Imaging, such as an electrocardiogram (ECG), may show a complete absence of atrioventricular (AV) conduction, with a dissociation between atrial and ventricular rhythms, confirming the diagnosis of Complete Heart Block.", "C-ANCA positive Vasculitis": "To diagnose C-ANCA positive Vasculitis, consider the following criteria: General symptoms often include systemic manifestations such as fatigue, weight loss, and fever, along with specific organ involvement such as respiratory, renal, or skin manifestations. During a physical examination, patients may exhibit signs of vasculitis, such as palpable purpura, ulcers, or nodules, and may have abnormal lung or kidney findings. Laboratory tests may reveal the presence of C-ANCA antibodies, along with elevated inflammatory markers such as erythrocyte sedimentation rate (ESR) and C-reactive protein (CRP). Imaging studies, such as chest X-ray or computed tomography (CT) scan, may show pulmonary infiltrates or nodules, while renal biopsy may demonstrate glomerulonephritis with necrotizing vasculitis.", "Appendiceal Tip Thickening": "To diagnose appendiceal tip thickening, consider the following criteria: General symptoms may include mild to moderate abdominal pain, often localized in the right lower quadrant (RLQ), and occasionally accompanied by low-grade fever or gastrointestinal symptoms. During a physical examination, tenderness or palpable mass may be present in the RLQ. Laboratory tests are usually nonspecific, but may show mild elevation in inflammatory markers such as white blood cell count or C-reactive protein. Imaging studies, such as ultrasound or computed tomography (CT), may reveal thickening of the appendiceal tip, indicating possible inflammation or infection.", "Chronic Lymphocytic Leukemia (CLL)": "To diagnose Chronic Lymphocytic Leukemia (CLL), consider the following criteria: General symptoms often include fatigue, weight loss, night sweats, and recurrent infections. Physical examination may reveal lymphadenopathy, hepatosplenomegaly, or signs of anemia or bleeding. Laboratory tests typically show an elevated lymphocyte count, with a predominance of small mature lymphocytes, and may also indicate anemia or thrombocytopenia. Imaging studies, such as computed tomography (CT) or ultrasound, may demonstrate lymph node enlargement or organ infiltration.", "Advanced Dementia": "To diagnose advanced dementia, consider the following criteria: General symptoms typically include severe cognitive decline, marked impairment in memory, language, and executive function, along with significant functional decline and dependence on others for daily activities. During a physical examination, patients may exhibit signs of muscle weakness, gait disturbances, and difficulties with coordination. Laboratory tests may reveal no specific abnormalities, but they are useful in ruling out other potential causes of cognitive decline, such as vitamin deficiencies or thyroid dysfunction. Imaging, such as magnetic resonance imaging (MRI), may show significant brain atrophy, particularly in the temporal and parietal lobes, along with the presence of white matter hyperintensities.", "Acute Subdural Hematoma": "To diagnose Acute Subdural Hematoma, consider the following criteria: General symptoms typically include a history of head trauma, followed by a lucid interval and subsequent deterioration in consciousness. Physical examination findings may reveal neurological deficits, such as hemiparesis or pupillary abnormalities. Laboratory tests are not specific for this condition, but may show nonspecific changes, such as anemia or coagulopathy. Imaging, particularly a non-contrast head CT scan, often demonstrates a crescent-shaped or concave hyperdensity overlying the cerebral hemisphere, indicating the presence of a hematoma.", "Gallbladder Necrosis": "To diagnose gallbladder necrosis consider the following criteria: General symptoms typically include severe abdominal pain, often localized to the right upper quadrant (RUQ), accompanied by fever, chills, and jaundice. During a physical examination, a patient might exhibit RUQ tenderness, guarding, and rigidity. Laboratory tests may reveal elevated liver enzymes, such as alanine aminotransferase (ALT) and aspartate aminotransferase (AST), as well as elevated bilirubin levels. Imaging studies, such as ultrasound or computed tomography (CT), may show signs of gallbladder wall thickening, pericholecystic fluid collection, or gas within the gallbladder wall, indicating necrosis.", "Unstable Angina": "To diagnose unstable angina consider the following criteria: General symptoms typically include chest pain or discomfort that is unpredictable, occurring at rest or with minimal exertion, and lasting longer than 10 minutes. During a physical examination, a patient might exhibit signs of distress, such as diaphoresis (excessive sweating) or shortness of breath. Laboratory tests may reveal elevated cardiac biomarkers, such as troponin, indicating myocardial damage. Imaging, such as an electrocardiogram (ECG), may show ST-segment depression or transient ST-segment elevation, indicating myocardial ischemia."}